# INSAID Telecom Data Analysis

<img src="Telecom_Image.jpg" style="width:900px;height:250px"/>

## Table of Content

1. [Import Libraries](#section1)<br>
2. [Database Connection](#section2)<br>
3. [Data Extraction and Exploration](#section3)<br>

<a id=section1></a>
### Import Libraries

In [16]:
import pandas as pd
import numpy as np
import pandas_profiling
import seaborn as sns
import matplotlib.pyplot as plt
import plotly
import plotly.graph_objects as go
import mysql.connector
import statistics

<a id=section2></a>
#### Database connection

In [31]:
connection = mysql.connector.connect(host='cpanel.insaid.co',
                                         database='Capstone1',
                                         user='student',
                                         password='student')

<a id=section3></a>
#### Data Extraction and Exploration

In [22]:
sql_select_Query = "select * from information_schema.columns where table_name = 'gender_age_train'"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("Total number of Columns in gender_age_train is: ", cursor.rowcount)
print("\nPrinting column Names of table gender_age_train ")
for row in records:
    print("Table_Name = ", row[2], )
    print("Column Name  = ", row[3], "\n")
    
print('---------------------------------------------------------------------------------------------------------')
sql_select_Query = "select * from gender_age_train"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("\n Storing records from gender_age_train to dataframe")

gender_age_train_df = pd.DataFrame(records,columns = ['device_id','gender','age','group'])

Total number of Columns in gender_age_train is:  4

Printing column Names of table gender_age_train
Table_Name =  gender_age_train
Column Name  =  device_id

Table_Name =  gender_age_train
Column Name  =  gender

Table_Name =  gender_age_train
Column Name  =  age

Table_Name =  gender_age_train
Column Name  =  group

---------------------------------------------------------------------------------------------------------

 Storing records from gender_age_train to dataframe

In [23]:
gender_age_train_df.head(5)

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [7]:
#gender_age_train_df_new = gender_age_train_df.rename(columns={0:'device_id',1:'gender',2:'age',3:'group'})

#### Checking the NULL values

In [26]:
gender_age_train_df.isnull().sum()

device_id    0
gender       0
age          0
group        0
dtype: int64

In [28]:
gender_age_train_df.shape

(74645, 4)

In [29]:
gender_age_train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74645 entries, 0 to 74644
Data columns (total 4 columns):
device_id    74645 non-null int64
gender       74645 non-null object
age          74645 non-null int64
group        74645 non-null object
dtypes: int64(2), object(2)
memory usage: 2.3+ MB

In [32]:
sql_select_Query = "select * from information_schema.columns where table_name = 'phone_brand_device_model'"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("Total number of Columns in phone_brand_device_model is: ", cursor.rowcount)
print("\nPrinting column Names of table phone_brand_device_model ")
for row in records:
    print("Table_Name = ", row[2], )
    print("Column Name  = ", row[3], "\n")
    
print('---------------------------------------------------------------------------------------------------------')
sql_select_Query = "select * from phone_brand_device_model"
cursor = connection.cursor()
cursor.execute(sql_select_Query)
records = cursor.fetchall()
print("\n Storing records from phone_brand_device_model to dataframe")

phone_brand_device_model_df = pd.DataFrame(records,columns = ['device_id','phone_brand','device_model'])

Total number of Columns in phone_brand_device_model is:  3

Printing column Names of table phone_brand_device_model
Table_Name =  phone_brand_device_model
Column Name  =  device_id

Table_Name =  phone_brand_device_model
Column Name  =  phone_brand

Table_Name =  phone_brand_device_model
Column Name  =  device_model

---------------------------------------------------------------------------------------------------------

 Storing records from phone_brand_device_model to dataframe

In [33]:
phone_brand_device_model_df.head()

             device_id phone_brand device_model
0  1877775838486905855        vivo          Y13
1 -3766087376657242966          小米         V183
2 -6238937574958215831        OPPO          R7s
3  8973197758510677470          三星        A368t
4 -2015528097870762664          小米      红米Note2

In [34]:
phone_brand_device_model_df['device_id'].unique()

array([ 1877775838486905855, -3766087376657242966, -6238937574958215831,
       ..., -3358291377416935026,  3282788959750981633,
        2491639413207286271], dtype=int64)

In [35]:
phone_brand_device_model_df.shape

(87726, 3)

In [36]:
phone_brand_device_model_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
device_id       87726 non-null int64
phone_brand     87726 non-null object
device_model    87726 non-null object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [37]:
phone_brand_device_model_df.isnull().sum()

device_id       0
phone_brand     0
device_model    0
dtype: int64

In [38]:
Events_data_df = pd.read_csv('F:\Data science Course\Machine learning-2\INSAID Telecom Capstone project\events_data.csv')

In [39]:
Events_data_df.head()

,event_id,device_id,timestamp,longitude,latitude,city,state
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.730140,Delhi,Delhi
1,2955066,4.734221e+18,2016-05-01 20:44:16,88.388361,22.660325,Calcutta,WestBengal
2,605968,-3.264500e+18,2016-05-02 14:23:04,77.256809,28.757906,Delhi,Delhi
3,448114,5.731369e+18,2016-05-03 13:21:16,80.343613,13.153332,Chennai,TamilNadu
4,665740,3.388880e+17,2016-05-06 03:51:05,85.997745,23.842609,Bokaro,Jharkhand

In [40]:
Events_data_df.shape

(3252950, 7)

In [41]:
Events_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
event_id     int64
device_id    float64
timestamp    object
longitude    float64
latitude     float64
city         object
state        object
dtypes: float64(3), int64(1), object(3)
memory usage: 173.7+ MB

In [42]:
Events_data_df.describe(include = 'all')

,event_id,device_id,timestamp,longitude,latitude,city,state
count,3.252950e+06,3.252497e+06,3252950,3.252527e+06,3.252527e+06,3252950,3252573
unique,NaN,NaN,588126,NaN,NaN,933,32
top,NaN,NaN,2016-05-03 10:00:03,NaN,NaN,Delhi,Delhi
freq,NaN,NaN,43,NaN,NaN,744276,751733
mean,1.626476e+06,1.012200e+17,NaN,7.815868e+01,2.168851e+01,NaN,NaN
std,9.390459e+05,5.316758e+18,NaN,4.235570e+00,5.789111e+00,NaN,NaN
min,1.000000e+00,-9.222957e+18,NaN,1.256700e+01,8.190110e+00,NaN,NaN
25%,8.132382e+05,-4.540611e+18,NaN,7.583543e+01,1.780171e+01,NaN,NaN
50%,1.626476e+06,1.726820e+17,NaN,7.726814e+01,2.216454e+01,NaN,NaN
75%,2.439713e+06,4.861813e+18,NaN,8.031916e+01,2.868278e+01,NaN,NaN
max,3.252950e+06,9.222849e+18,NaN,9.545946e+01,4.187190e+01,NaN,NaN

In [43]:
Events_data_df.isnull().sum()

event_id       0
device_id    453
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [44]:
DeviceModevalue = statistics.mode(Events_data_df['device_id'])
DeviceModevalue

5.536513450525271e+18

In [45]:
Events_data_df['device_id'].fillna(DeviceModevalue , inplace=True )
Events_data_df.isnull().sum()

event_id       0
device_id      0
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [47]:
Event_Device_df = pd.merge(Events_data_df,phone_brand_device_model_df, how='inner' , left_on='device_id',right_on='device_id')
Event_Device_df.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,phone_brand,device_model
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.73014,Delhi,Delhi,优米,UIMI3
1,1355198,2.973348e+18,2016-05-01 01:35:45,77.225676,28.73014,Delhi,Delhi,优米,UIMI3
2,1630972,2.973348e+18,2016-05-03 00:07:34,77.225676,28.73014,Delhi,Delhi,优米,UIMI3
3,2732453,2.973348e+18,2016-05-01 06:15:59,77.225676,28.73014,Delhi,Delhi,优米,UIMI3
4,1562542,2.973348e+18,2016-05-01 20:34:19,77.225676,28.73014,Delhi,Delhi,优米,UIMI3

In [48]:
Event_Device_df.isnull().sum()

event_id        0
device_id       0
timestamp       0
longitude       0
latitude        0
city            0
state           0
phone_brand     0
device_model    0
dtype: int64

In [50]:
Telecom_df = pd.merge(Event_Device_df,gender_age_train_df, how='inner', left_on = 'device_id' , right_on='device_id')
Telecom_df.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,phone_brand,device_model,gender,age,group
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.73014,Delhi,Delhi,优米,UIMI3,M,35,M32-38
1,1355198,2.973348e+18,2016-05-01 01:35:45,77.225676,28.73014,Delhi,Delhi,优米,UIMI3,M,35,M32-38
2,1630972,2.973348e+18,2016-05-03 00:07:34,77.225676,28.73014,Delhi,Delhi,优米,UIMI3,M,35,M32-38
3,2732453,2.973348e+18,2016-05-01 06:15:59,77.225676,28.73014,Delhi,Delhi,优米,UIMI3,M,35,M32-38
4,1562542,2.973348e+18,2016-05-01 20:34:19,77.225676,28.73014,Delhi,Delhi,优米,UIMI3,M,35,M32-38

In [51]:
Telecom_df.shape

(16982, 12)

In [52]:
Telecom_df.isnull().sum()

event_id        0
device_id       0
timestamp       0
longitude       0
latitude        0
city            0
state           0
phone_brand     0
device_model    0
gender          0
age             0
group           0
dtype: int64

In [53]:
Telecom_df['device_id'].value_counts()

 2.728779e+16    1091
 8.765877e+18     466
 6.577099e+16     426
-1.627458e+16     388
-4.496985e+15     379
-6.254527e+15     334
-4.973076e+16     333
 5.038733e+15     330
 2.036140e+17     306
-1.526872e+16     297
 1.274328e+17     285
 1.337418e+18     276
-1.116277e+18     224
-5.334703e+17     215
 1.161113e+18     209
 4.892704e+17     204
-2.797790e+16     200
 2.973348e+18     194
-9.671515e+17     191
-2.662495e+17     189
-9.517737e+17     186
 4.130379e+17     181
 7.409328e+15     160
-6.857195e+15     159
-4.683665e+17     155
-4.541880e+17     151
 7.636862e+16     151
 1.438236e+18     144
 3.045624e+16     144
-1.367860e+18     141
                 ...
-1.844596e+17       1
-2.581588e+17       1
 1.715452e+16       1
 2.599872e+16       1
 7.276345e+15       1
-3.646855e+17       1
-1.145956e+16       1
-6.289140e+18       1
-2.336603e+16       1
-1.268112e+17       1
-3.917548e+18       1
 2.226134e+16       1
-2.056028e+17       1
 9.409945e+15       1
 7.392017e+14       1
 5.162240e+17       1
-2.342377e+16       1
 1.093848e+18       1
-1.638313e+18       1
-1.331472e+16       1
-9.880976e+15       1
-1.029625e+18       1
 3.501847e+18       1
-6.355276e+17       1
-9.869566e+15       1
-1.025285e+18       1
-1.025467e+18       1
 3.711362e+18       1
 1.512378e+18       1
-4.791325e+17       1
Name: device_id, Length: 406, dtype: int64